## Final Project Submission

Please fill out:
* Student name: SHADRACK CHERUIYOT
* Student pace: DSF-PT02
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [1]:
#Importing the necessary extensions
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
#studying various Datasets
#"I will examine various datasets in the following codecells below"

In [3]:
###Dataset 1 - "bom.movie_gross.csv"
df1 = pd.read_csv('bom.movie_gross.csv')
df1_len = str(len(df1))
print("The dataset has " + df1_len + " rows")
print(df1.head())

The dataset has 3387 rows
                                         title studio  domestic_gross  \
0                                  Toy Story 3     BV     415000000.0
1                   Alice in Wonderland (2010)     BV     334200000.0
2  Harry Potter and the Deathly Hallows Part 1     WB     296000000.0
3                                    Inception     WB     292600000.0
4                          Shrek Forever After   P/DW     238700000.0

  foreign_gross  year
0     652000000  2010
1     691300000  2010
2     664300000  2010
3     535700000  2010
4     513900000  2010

In [4]:
#Dataset 2 - "title.basics.csv"
df2 = pd.read_csv('title.basics.csv')
df2_len = str(len(df2))
print("The dataset has " + df2_len + " rows")
print(df2.head())

The dataset has 146144 rows
      tconst                    primary_title              original_title  \
0  tt0063540                        Sunghursh                   Sunghursh
1  tt0066787  One Day Before the Rainy Season             Ashad Ka Ek Din
2  tt0069049       The Other Side of the Wind  The Other Side of the Wind
3  tt0069204                  Sabse Bada Sukh             Sabse Bada Sukh
4  tt0100275         The Wandering Soap Opera       La Telenovela Errante

   start_year  runtime_minutes                genres
0        2013            175.0    Action,Crime,Drama
1        2019            114.0       Biography,Drama
2        2018            122.0                 Drama
3        2018              NaN          Comedy,Drama
4        2017             80.0  Comedy,Drama,Fantasy

In [5]:
#Dataset 3 - "tmdb.movies.csv"
df3 = pd.read_csv('tmdb.movies.csv', index_col=0)
df3_len = str(len(df3))
print("The dataset has " + df3_len + " rows")
print(df3.head())

The dataset has 26517 rows
             genre_ids     id original_language  \
0      [12, 14, 10751]  12444                en
1  [14, 12, 16, 10751]  10191                en
2        [12, 28, 878]  10138                en
3      [16, 35, 10751]    862                en
4        [28, 878, 12]  27205                en

                                 original_title  popularity release_date  \
0  Harry Potter and the Deathly Hallows: Part 1      33.533   2010-11-19
1                      How to Train Your Dragon      28.734   2010-03-26
2                                    Iron Man 2      28.515   2010-05-07
3                                     Toy Story      28.005   1995-11-22
4                                     Inception      27.920   2010-07-16

                                          title  vote_average  vote_count
0  Harry Potter and the Deathly Hallows: Part 1           7.7       10788
1                      How to Train Your Dragon           7.7        7610
2                                    Iron Man 2           6.8       12368
3                                     Toy Story           7.9       10174
4                                     Inception           8.3       22186

In [24]:
#Dataset 4 - "tn.movie_budgets.csv"
df4 = pd.read_csv('tn.movie_budgets.csv', index_col=0)
df4 = df4.set_index('production_budget').sort_index(ascending=False)
df4_len = str(len(df4))
print("The dataset has "+ df4_len+ " rows")
df4.head(10)

The dataset has 5782 rows

,release_date,movie,domestic_gross,worldwide_gross
production_budget,,,,
"$99,000,000","Nov 6, 2015",The Peanuts Movie,"$130,178,411","$250,091,610"
"$99,000,000","Feb 8, 2019",The LEGO Movie 2: The Second Part,"$105,806,508","$190,325,698"
"$99,000,000","Nov 21, 2018",Robin Hood,"$30,824,628","$84,747,441"
"$989,000","Jun 1, 2007",And Then Came Love,"$8,158","$8,158"
"$98,000,000","May 4, 2001",The Mummy Returns,"$202,007,640","$435,040,395"
"$97,000,000","Dec 20, 2002",Gangs of New York,"$77,730,500","$183,124,621"
"$97,000,000","May 19, 2017",Alien: Covenant,"$74,262,031","$238,521,247"
"$950,000","Mar 3, 2015",Ask Me Anything,$0,$0
"$950,000","Aug 12, 2014",Jesse,$0,$0
"$950,000","Apr 14, 2006",Hard Candy,"$1,024,640","$8,267,066"

In [21]:
#Dataset 5 - "title.principals.csv"
df5 = pd.read_csv('title.principals.csv', index_col=0)
df5 = df5.set_index('ordering').sort_index(ascending=False)
df5_len = str(len(df5))
print("The dataset has "+ df5_len+ " rows")
df5.head()

The dataset has 1028186 rows

             nconst  category       job   characters
ordering
10        nm0695252    editor       NaN          NaN
10        nm3972625  producer  producer          NaN
10        nm5326931    editor       NaN          NaN
10        nm4732302     actor       NaN  ["Gilbert"]
10        nm7757299     actor       NaN   ["Mihkel"]

In [20]:
#Dataset 6 - "title.akas.csv"
df6 = pd.read_csv('title.akas.csv', index_col=0)
df6 = df6.set_index('ordering')
df6 = df6.sort_index(ascending=False)
df6_len = str(len(df6))
print("The dataset has "+ df6_len+ " rows")
df6.head()

The dataset has 331703 rows

,title,region,language,types,attributes,is_original_title
ordering,,,,,,
61,Žvaigždžiu karai: galia nubunda,LT,NaN,NaN,NaN,0.0
60,Star Wars: Güç Uyaniyor,TR,tr,imdbDisplay,NaN,0.0
59,Star Wars: Episódio VII - O Despertar da Força,PT,NaN,imdbDisplay,NaN,0.0
58,Star Wars: O Despertar da Força,BR,NaN,imdbDisplay,NaN,0.0
57,Star Wars: Das Erwachen der Macht,DE,NaN,alternative,NaN,0.0